Repository: milaxcoo/Seasons
Catalog: lib/l10n/app_*.arb
Languages: ru

# appTagline
source: seasons
ru: времена года

# login
source: Sign In
ru: Войти

# copyright
source: © RUDN University 2025
ru: © RUDN University 2026

# noActiveVotings
source: No active votings yet
ru: Нет активных голосований

# registrationUntil
source: Registration until: {date}
ru: Регистрация до: {date}

# registrationOpen
source: Registration is open
ru: Регистрация открыта

source: Registration closed
ru: Регистрация закрыта

# votingUntil
source: Voting until: {date}
ru: Голосование до: {date}

# votingActive
source: Voting in progress
ru: Идет голосование

# completedOn
source: Completed: {date}
ru: Завершено: {date}

source: Completed
ru: Завершено

source: Registered
ru: Зарегистрирован(-а)

source: Not registered
ru: Не зарегистрирован(-а)

source: Voted
ru: Проголосовал(-а)

source: Not voted
ru: Не проголосовал(-а)

source: User Data
ru: Данные пользователя

# failedToLoadProfile
source: Failed to load profile data
ru: Не удалось загрузить данные профиля

source: Surname
ru: Фамилия

source: Name
ru: Имя

source: Patronymic
ru: Отчество

source: Email
ru: Электронная почта

source: Job Title
ru: Должность

# registrationStart
source: Registration started at
ru: Начало регистрации

# registrationEnd
source: Registration ended at
ru: Завершение регистрации

source: Status
ru: Статус

# registerButton
source: Register
ru: Зарегистрироваться

# alreadyRegistered
source: You are already registered
ru: Вы уже зарегистрированы

source: Registering...
ru: Идет регистрация...

# registrationSuccess
source: You have been successfully registered!
ru: Вы были успешно зарегистрированы!

# registrationError
source: Registration error: {error}
ru: Ошибка регистрации: {error}

# notSet
source: N/A
ru: Не установлено

# votingStart
source: Voting started at
ru: Начало голосования

# votingEnd
source: Voting end at
ru: Завершение голосования

source: Voting in progress
ru: Идет голосование

source: Are you sure?
ru: Вы уверены?

# voteConfirmationMessage
source: After confirmation, your vote will be counted and cannot be changed.
ru: После подтверждения ваш голос будет засчитан, и изменить его будет нельзя.

source: Cancel
ru: Отмена

source: Vote
ru: Проголосовать

# answerAllQuestions
source: Please answer all questions.
ru: Пожалуйста, ответьте на все вопросы.

source: Vote Accepted
ru: Голос принят

# thankYou
source: Thank you for participating!
ru: Спасибо за участие!

# alreadyVotedError
source: Your vote has already been counted.
ru: Ваш голос уже был учтен ранее.

# error
source: Error: {error}
ru: Ошибка: {error}

# noQuestionsAvailable
source: No questions available for this voting.
ru: Вопросы для этого голосования отсутствуют.

# alreadyVoted
source: You have already voted
ru: Вы уже проголосовали

source: Description
ru: Описание

# votingStartLabel
source: Voting started at
ru: Начало голосования

# votingEndLabel
source: Voting ended at
ru: Завершение голосования

# sessionCompleted
source: Voting finished
ru: Заседание завершено

# resultsUnavailable
source: Results for this voting are not available.
ru: Результаты для этого голосования отсутствуют.

source: Voting results
ru: Результаты голосования

source: Vote Count
ru: Количество голосов
